Revit 2027 API
FabricationService.IsCompatibleWith Method
 Check whether the service is broadly interchangable with another one without affecting part geometry. The services must have the same fabrication system template and specification.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCompatibleWith(
	FabricationService otherService
)
Public Function IsCompatibleWith (
	otherService As FabricationService
) As Boolean
public:
bool IsCompatibleWith(
	FabricationService^ otherService
)
member IsCompatibleWith :
        otherService : FabricationService -> bool
Parameters
otherService FabricationService
Return Value
Boolean
 Returns true if the services are compatible.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationService Class
Autodesk.Revit.DB Namespace